Tekla Open API Reference for Tekla Structures 2025
Events.ModelLoadInfo Event
 The ModelLoadInfo event is raised just after a model has been loaded with the model load information as a string parameter.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public event Events.ModelLoadInfoDelegate ModelLoadInfo
Public Event ModelLoadInfo As Events.ModelLoadInfoDelegate
Value
Type: Tekla.Structures.Model.Events.ModelLoadInfoDelegate
Implements
IEvents.ModelLoadInfo
See Also
Reference
Events Class
Tekla.Structures.Model Namespace